#                           Площа перетину тора
import math # Імпортую математику, щоб можна було викликати число пі
print("Підрахунок площі тора")
print("Введіть внутрішній діаметр (мм)") 
R1 = float(input())/2 # input() все що прийняв перетворює на str, тому перетворюю назад на float
s1 = math.pi * R1 ** 2 # Піднесення до степеню 2
print("Введіть зовнішній діаметр (мм)")
R2 = float(input())/2
s2 = math.pi * R2 ** 2

print(f"Площа тора: {round(s2-s1, 2)} мм2") # Округлення до двох знаків після коми. Округлює за правилами
# математики (те що більше 0,005 стає 0,01)
input() # Це щоб вікно не закривалось після завешрення програми. В віндовс можна просто клацнути по файлу
# і він виконується.


'''
в Python функція round() має особливість. Вона використовує так зване "банківське округлення"
або "округлення до найближчого парного числа" (round half to even). Це означає, що коли число знаходиться
рівно посередині між двома цілими числами (тобто закінчується на .5), воно округлюється до найближчого
парного цілого числа.

Саме тому:
round(2.5) поверне 2 (бо 2 - парне)
round(3.5) поверне 4 (бо 4 - парне)

Цей метод використовується, щоб зменшити накопичення помилок при великій кількості обчислень, оскільки
він симетричний.
Якщо вам потрібно традиційне округлення ("округлення від нуля"), ви можете використовувати інші методи,
наприклад, з модулем decimal або шляхом додавання 0.5 і використання int() (для позитивних чисел).
'''