#                            Площа перетину труби
'''
import math # Імпортую математику, щоб можна було викликати число пі
print("Підрахунок площі перетину труби")
print("Введіть внутрішній діаметр (мм)")
R1 = float(input())/2 # input() все що прийняв перетворює на str, тому перетворюю назад на float
s1 = math.pi * R1 ** 2 # Піднесення до степеню 2.

print(f"Площа труби: {round(s1, 2)} мм2.") # Округлення до двох знаків після коми. Округлює за правилами математики (те що більше 0,005 стає 0,01)
input() # Це щоб вікно не закривалось після завешрення програми. В віндовс можна просто клацнути по файлу і він виконується.
'''
#                           Площа перетину тора
import math
print("Підрахунок площі тора")
print("Введіть внутрішній діаметр (мм)") 
R1 = float(input())/2
s1 = math.pi * R1 ** 2
print("Введіть зовнішній діаметр (мм)")
R2 = float(input())/2
s2 = math.pi * R2 ** 2

print(f"Площа тора: {round(s2-s1, 2)} мм2")
input()