"""
Твій сайт розділений по вертикалі на розділи і кожен розділ може бути різного розміру (висоти).
Тобі необхідно визначити індекс розділу, на якому ти перебуваєш, враховуючи scroll і sizes всіх розділів.
Розділи починаються з 0, тому, якщо перший розділ має висоту 200, він займає 0-199 пікселів, а другий починається з 200.
Тобі потрібно написати функцію get_section_id, яка приймає ціле число scroll (завжди невід'ємне) і список невід'ємних
цілих чисел sizes (хоча б з одним елементом), ця функція обчислює індекс (починаючи з 0) та повертає цей індекс або -1,
якщо scroll виходить за межі останнього розділу (індикація помилки).
Приклад:
get_section_id(300, [300,200,400,600,100]) # повертає 1
Пояснення: поверне номер 1, оскільки це другий розділ.
Приклад:
get_section_id(1600, [300,200,400,600,100]) # повертає -1
Пояснення: поверне число -1, оскільки він пройшов останній розділ.
"""

def get_section_id(scroll: int, sizes: list) -> int:
    if scroll >= sum(sizes):
        return -1
    counter = 0
    for index, size in enumerate(sizes):
        counter += size
        if scroll < counter:
            return index

print(get_section_id(1500, [300,200,400,600,100]))
print(get_section_id(1600, [300,200,400,600,100]))
