'''
створи функцію `remove_vowels()`, яка:
1. Приймає рядок `document`.
2. Повертає новий рядок, з якого вилучені всі
голосні літери.
💡 Голосними літерами є
`a`, `e`, `i`, `o`, `u`, `y`
(великі та малі літери).

Для реалізації цієї задачі використай:
- новий рядок `result_string`, щоб зберегти
результат без голосних літер;
- цикл `for` або `while` для ітерації по
кожному символу в рядку `doc`;
- умовний оператор `if` для перевірки, чи є
поточний символ голосною літерою;
- ключове слово `return`, щоб повернути результат.
'''
def remove_vowels(document):
    vowels = {`a`, `e`, `i`, `o`, `u`, `y`}
    result_string = ''
    for i in document:
        if i not  in vowels:
            result_string.append(i)

