import pdb
def find_max(numbers):
    '''Припустимо, що функція `find_max()` знаходить і повертає максимальне число в списку цілих чисел.
Однак у реалізації є баг, через який ми отримуємо неправильні результати або помилку.
Твоє завдання:
1. Визнач та виправ помилку у функції `find_max()`.
2. Переконайся, що функція повертає правильну максимальну кількість для заданих тестів.
3. Розглянь крайові випадки, такі як порожній список.
💡 Зверни увагу на те, як ініціалізується та порівнюється змінна `max_num` у циклі.
**Рекомендуємо тобі спробувати розв'язати цю задачу за допомогою вивчених інструментів дебагінгу у PyCharm.**
'''
    max_num = int(numbers[0])
    pdb.set_trace()
    for num in numbers:
       pdb.set_trace()
       if max_num < int(num):
            max_num = int(num)
    return max_num
string_int_numbers = input("Введіть список цілих чисел\n")
list_numbers = string_int_numbers.split(", ")
print(f"Макс. число: {find_max(list_numbers)}")
