'''
Уяви, що ти плануєш покращити свою фізичну форму і хочеш почати бігати.
Ти почнеш з `5` кілометрів на тиждень і збільшуватимеш дистанцію бігу на `2` кілометри щомісяця
протягом року.
Використовуючи цикл `for`, розрахуй потижневу дистанцію, яку ти пробігатимеш за `10` тижнів.
Використай `print()` всередині циклу, щоб показати, скільки ти пробіг кожного тижня.
'''
start_distance = int(input("Введіть початкову дистанцію (в км.)\n"))
increment = int(input("Введіть скільки ви будете додавати щомісяця до цієї відстані \n"))
distance = start_distance
for month in range(12):
    print(f"В {month+1} місяці ти пробігатимеш {distance}")
    distance += increment